In [2]:
import pandas as pd

In [3]:
## Series
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Create series from dictionary
data = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data)
print("\nSeries from Dictionary\n", series_dict)
print(type(series_dict))

Series from Dictionary
 a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
data = [10, 20, 30]
index = ['a', 'b', 'c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
## DataFrame
## Createe a dataframe from dictionary of list
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 45],
    "City": ["New York", "Los Angeles", "Chicago"]
}
df = pd.DataFrame(data)
print("\nDataFrame \n", df)
print(type(df))

DataFrame
       Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   45      Chicago
<class 'pandas.core.frame.DataFrame'>

In [8]:
import numpy as np
np.array(df)

array([['Alice', 25, 'New York'],
       ['Bob', 30, 'Los Angeles'],
       ['Charlie', 45, 'Chicago']], dtype=object)

In [14]:
## Create DataFrame from list of Dictionary
data = [
    {"Name": "Alice", "Age": 25, "City": "New York"},
    {"Name": "Bob", "Age": 30, "City": "Los Angeles"},
    {"Name": "Charlie", "Age": 45, "City": "Chicago"}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   45      Chicago
<class 'pandas.core.frame.DataFrame'>

In [11]:
df = pd.read_csv('sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [15]:
## Accessing Data from DataFrame
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   45      Chicago

In [18]:
df["Name"]

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [24]:
df.loc[1][2]

C:\Users\Thoyajaksha Kashyap\AppData\Local\Temp\ipykernel_32876\3163812330.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[1][2]

'Los Angeles'

In [23]:
df.iloc[1][2]

C:\Users\Thoyajaksha Kashyap\AppData\Local\Temp\ipykernel_32876\65333983.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][2]

'Los Angeles'

In [28]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   45      Chicago

In [26]:
## Accessing specific element
df.at[1, 'Age']

30

In [27]:
df.iat[1, 1]

30

In [29]:
## Data Manipulation with DataFrame
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   45      Chicago

In [30]:
df['Salary'] = [50000, 60000, 70000]
df

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   45      Chicago   70000

In [33]:
## Removing a column
df.drop('Salary', axis=1, inplace=True)

In [34]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   45      Chicago

In [35]:
## Add age to the column
df["Age"] = df["Age"] + 1
df

      Name  Age         City
0    Alice   26     New York
1      Bob   31  Los Angeles
2  Charlie   46      Chicago

In [38]:
df.drop(0, inplace=True)

In [39]:
df

      Name  Age         City
1      Bob   31  Los Angeles
2  Charlie   46      Chicago

In [40]:
df = pd.read_csv('sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [44]:
# Display the data types of each column
print("Data types:\n", df.dtypes)
# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000